spec/fixtures/vcr_cassettes/Remitano_Client_merchant_charges/_get/object_exists/returns_charge_data.yml

---
http_interactions:
- request:
    method: get
    uri: REMITANO_SERVER/api/v1/merchant/merchant_charges/19?usec=0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin18.6.0 x86_64) ruby/2.4.3p205
      Content-Type:
      - application/json
      Date:
      - Fri, 28 May 2021 06:54:16 GMT
      Authorization:
      - APIAuth REMITANO_KEY:i2pCySrcEIkh+HqE9k6hIqPk398=
      Host:
      - localhost:3100
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Etag:
      - W/"72401e84d6cdc5c4e748e0201234c9ad"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - a0da7836-edc9-42a3-93dc-f9704dfba675
      X-Runtime:
      - '0.083987'
      Vary:
      - Origin
      Content-Length:
      - '274'
    body:
      encoding: UTF-8
      string: '{"id":19,"coin_currency":"usdt","coin_amount":100.0,"status":"completed","ref":"MDR1248236781","cancelled_or_completed_callback_url":"http://sample.com/123/callback","remitano_payment_url":"localhost:3200/payment_gateway/pay/MDR1248236781","created_at_timestamp":1620093168}'
    http_version:
  recorded_at: Fri, 28 May 2021 06:54:16 GMT
recorded_with: VCR 4.0.0
